////////////////////////////////////////////////////////////////////////////////

// supervisor

// npm i -g supervisor // встановиться в C:\Users\userName\AppData\Roaming\npm

// Слідкує за файлами і у випадку зміни робить перезапуск сервера (watching).
// Тепер не потрібно постійно перезапускати сервер, але браузер все-одно
// перезапускати потрібно.
// У старих версіях має особливість: слідкує тільки за файлами, які існували на
// момент запуску. Якщо створбється новий модуль, який буде підключатися через
// уже існуючий - теж жодних проблем. Але якщо файл незалежний від інших,
// supervisor його не побачить і його доведеться перезапускати. Також може
// статися таке: якщо у директорії проекту є node_modules, а там багато файлів,
// supervisor також починає за ними слідкувати, що може призвести до
// підтуплювання системи. Вирішення проблеми: запуск з параметром ignore, або
// перемістити node_modules на рівень вище.


// Запуск cmd:
// supervisor file.js // замість node file.js

// WebStorm:
// потрібно змінити конфігурацію, в поле "Node interpreter" треба внести шлях до
// файлу supervisor.cmd


// nodemon
// Аналог supervisor'a