////////////////////////////////////////////////////////////////////////////////

// I. debug / inspect

// debug застарів, треба використовувати inspect. Використовуєься рідко, в
// основному, коли "продвинуті методи відладки не працюють"

// в коді прописати команду debugger,
// в консолі:
//   node inspect file_name.js

// help   - підказки по командах
// c[ont] - продовжити виконання
// repl   - режим "repl" - можна вводити назви змінних та отримувати їх поточні
//          значення, запускати методи і т.д.


// II. Браузер + node-inspector

// npm i -g node-inspector // Я НЕ ЗМІГ ВСТАНОВИТИ NODE-INSPECTOR, ПОСТІЙНО
//                         // ВИЛІТАЮТЬ ПОМИЛКИ!!!

// В консолі:
//   node --debug file_name.js   // метод застарів
//   node --inspect file_name.js // використовувати це

// В другій консолі:
//   node-inspector
// У відповідь прийде адреса, яку потрібно ввести в браузер і там буде
// відбуватися відлагодження.


// III. Глибоке відлагодження
// (У МЕНЕ ЗНОВУ-ТАКИ НЕ ПРАЦЮЄ)

// NODE_DEBUG="cluster fs http module net timer tls"

// Наприклад, для перевірки, що передається по мережі:

//   NODE_DEBUG="http net" node file_name.js